STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/lowpower/app_lowpower.c
  /* USER push-button will be used to wakeup the system from Standby mode */
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN2_LOW);
  HAL_Delay(10);

  /* Optimize GPIO consumption (analog) for standby mode */
  GPIOoptimStandby(WAKEUP_GPIO);

  /* Clear PWR wake up Flag */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

  /* Standby mode */
  HAL_PWR_EnterSTANDBYMode();

  /* Following code should never be reach as MCU reset when exitting from standby */
  while(1);
}

/**
  * @brief  Run the Lowpower Standby mode RTC Alarm
  * @param  None.
  * @note   run and display information about the lowpower feature.
  * @retval None.
  */
void LowPowerStandbyRTCAlarm(void)
{
  kWindow_Popup("STANDBY Alarm", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                "\nset delay time\n",                            \
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* Set the alarm */
  LowPowerHandleAlarm();

  kWindow_Popup("STANDBY Alarm", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                "\nstandby mode\nstarted\nwait alarm\nto exit\nand reset\n",                            \
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* Optimize GPIO consumption (analog) for standby mode */
  GPIOoptimStandby(WAKEUP_RTC);

  /* Clear PWR wake up Flag */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

  /* Enter StandBy mode */
  HAL_PWR_EnterSTANDBYMode();

  /* Following code should never be reach as MCU reset when exitting from standby */
  while(1);
}

/**
  * @brief  Enter in sleep mode and exit by pressing the USER button
  * @param  None
  * @note   This example enter in sleep mode.
  * @retval None
  */
void LowPowerSleepEXTI(void)
{
  kWindow_Popup("SLEEP EXTI", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                "\n\nPress JOY sel to\nstart\nsleep mode\n",   \
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* Wait for key press */
  HAL_Delay(100);
  user_event = JOY_UP;
  while(user_event != JOY_SEL)
  {
    user_action = 0;
  };

  kWindow_Popup("SLEEP EXTI", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,     \
                "\n\nsleep mode\nstarted\npress USER button\nto exit\n",\
                 UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* USER push-button will be used to wakeup the system from SLEEP mode */
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  /* avoid wakeup from JOY event */
  BSP_JOY_DeInit(JOY1, JOY_ALL);
  BSP_IO_DeInit(JOY1);

  /* Clear PWR wake up Flag */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

  /*************************************************************/
  /*  Disable all peripheral clock during SLEEP mode           */
  /*  and put GPIO in analog mode to optimize power consumtion */
  /*************************************************************/
  SystemPeripheralClockDisable(WAKEUP_GPIO);

  /* Suspend HAL tick irq */
  HAL_SuspendTick();

  /* Enable Flash power down mode during Sleep mode      */
  /* (comment this line if power consumption figures     */
  /*  must be measured with Flash still on in Sleep mode */
  __HAL_FLASH_SLEEP_POWERDOWN_ENABLE();

  /*********************/
  /* Enter Sleep Mode   */
  /*********************/
  HAL_PWR_EnterSLEEPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI);

  /* Resume HAL tick irq */
  HAL_ResumeTick();

  /********************************************************/
  /*  Restore peripheral clock and Gpio configuration     */
  /*  which have been disabled during SLEEP mode           */
  /********************************************************/
  SystemPeripheralClockEnable();

  /* Restore Joystick in interrupt mode */
  BSP_JOY_Init(JOY1, JOY_MODE_EXTI, JOY_ALL);

  /* Display info */
  LowPowerExitDisplay(SLEEP);
}

/**
  * @brief  Enter in sleep mode and exit by an alarm
  * @param  None
  * @note   This example enter in sleep mode.
  * @retval None
  */
void LowPowerSleepRTCAlarm(void)
{
  kWindow_Popup("SLEEP Alarm", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                "\nset delay time\n",                          \
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* set the alarm */
  LowPowerHandleAlarm();

  kWindow_Popup("SLEEP Alarm", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,  \
                "\n\nsleep mode\nstarted\nwait alarm\nto exit\n",\
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* De Init Joystick */
  BSP_JOY_DeInit(JOY1, JOY_ALL);
  BSP_IO_DeInit(JOY1);

  /*************************************************************/
  /*  Disable all peripheral clock during SLEEP mode           */
  /*  and put GPIO in analog mode to optimize power consumtion */
  /*************************************************************/
  SystemPeripheralClockDisable(WAKEUP_RTC);

  /* Suspend HAL tick irq */
  HAL_SuspendTick();

  /* Enable Flash power down mode during Sleep mode       */
  /* (comment this line if power consumption figures      */
  /*  must be measured with Flash still on in Sleep mode) */
  __HAL_FLASH_SLEEP_POWERDOWN_ENABLE();

  /*******************/
  /* Enter Sleep Mode */
  /*******************/
  HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);

  /* Resume HAL tick irq */
  HAL_ResumeTick();

  /********************************************************/
  /*  Restore peripheral clock and Gpio configuration     */
  /*  which have been disabled during SLEEP mode          */
  /********************************************************/
  SystemPeripheralClockEnable();

  /* Display info */
  LowPowerExitDisplay(SLEEP);

  /* Deactivate RTC alaram */
  HAL_RTC_DeactivateAlarm(&RtcHandle, RTC_ALARM_B);

  /* Clear the Alarm interrupt pending bit */
  __HAL_RTC_ALARM_CLEAR_FLAG(&RtcHandle,RTC_FLAG_ALRBF);

  /* Restore Joystic in interrupt mode */
  BSP_JOY_Init(JOY1, JOY_MODE_EXTI, JOY_ALL);
}

/**
  * @brief  Enter in stop mode and exit by pressing the USER button
  * @param  None
  * @note   This example enter in stop mode.
  * @retval None
  */
void LowPowerStopEXTI(void)
{
  kWindow_Popup("STOP EXTI", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                "\n\nPress JOY sel to\nstart\nstop mode\n",   \
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* Wait for keypress */
  HAL_Delay(100);
  user_event = JOY_UP;
  while(user_event != JOY_SEL)
  {
    user_action = 0;
  };

  kWindow_Popup("STOP EXTI", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,     \
                "\n\nstop mode\nstarted\npress USER button\nto exit\n",\
                 UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

