STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/lowpower/app_lowpower.c
  /* USER push-button will be used to wakeup the system from STOP mode */
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  /* avoid wakeup from JOY event */
  BSP_JOY_DeInit(JOY1, JOY_ALL);
  BSP_IO_DeInit(JOY1);

  /* Clear PWR wake up Flag */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

  /*************************************************************/
  /*  Disable all peripheral clock during STOP mode            */
  /*  and put GPIO in analog mode to optimize power consumtion */
  /*************************************************************/
  SystemPeripheralClockDisable(WAKEUP_GPIO);

  /*********************/
  /* Enter Stop Mode   */
  /*********************/
  HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);

  /* Restore the clock configuration */
  SystemClock_Config();

  /********************************************************/
  /*  Restore peripheral clock and Gpio configuration     */
  /*  which have been disabled during STOP mode           */
  /********************************************************/
  SystemPeripheralClockEnable();

  /* Restore Joystick in interrupt mode */
  BSP_JOY_Init(JOY1, JOY_MODE_EXTI, JOY_ALL);

  /* Display info */
  LowPowerExitDisplay(STOP);
}

/**
  * @brief  Enter in stop mode and exit by an alarm
  * @param  None
  * @note   This example enter in stop mode.
  * @retval None
  */
void LowPowerStopRTCAlarm(void)
{
  kWindow_Popup("STOP Alarm", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                "\nset delay time\n",                          \
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* set the alarm */
  LowPowerHandleAlarm();

  kWindow_Popup("STOP Alarm", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,  \
                "\n\nstop mode\nstarted\nwait alarm\nto exit\n",\
                UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  /* De Init Joystick */
  BSP_JOY_DeInit(JOY1, JOY_ALL);
  BSP_IO_DeInit(JOY1);

  /*************************************************************/
  /*  Disable all peripheral clock during STOP mode            */
  /*  and put GPIO in analog mode to optimize power consumtion */
  /*************************************************************/
  SystemPeripheralClockDisable(WAKEUP_RTC);

  /*******************/
  /* Enter Stop Mode */
  /*******************/
  HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);

  /* Restore the clock configuration */
  SystemClock_Config();

  /********************************************************/
  /*  Restore peripheral clock and Gpio configuration     */
  /*  which have been disabled during STOP mode           */
  /********************************************************/
  SystemPeripheralClockEnable();

  /* Display info */
  LowPowerExitDisplay(STOP);

  HAL_RTC_DeactivateAlarm(&RtcHandle, RTC_ALARM_B);

  /* Clear the Alarm interrupt pending bit */
  __HAL_RTC_ALARM_CLEAR_FLAG(&RtcHandle,RTC_FLAG_ALRBF);

  BSP_JOY_Init(JOY1, JOY_MODE_EXTI, JOY_ALL);
}

/**
  * @brief  Get user info to setup an alarm
  * @note   This function wait user info to setup the alarm.
  * @retval None
  */
static void LowPowerHandleAlarm(void)
{
  enum {
    HOURS,
    MINUTES,
    SECONDS,
    END
  };

  RTC_DateTypeDef currentdate = {0};
  RTC_TimeTypeDef time = {0};
  RTC_TimeTypeDef currenttime = {0};
  RTC_AlarmTypeDef Alarm = {0};
  sFONT *font;
  uint8_t temp[16];
  uint8_t exit = 0;
  uint8_t index = SECONDS;
  uint8_t position;
  uint8_t statpos;
  uint32_t pXSize;

  /* get current font */
  font = UTIL_LCD_GetFont();
  BSP_LCD_GetXSize(LCD_INSTANCE, &pXSize);
  statpos = (pXSize >> 1) - (4 * font->Width);

  /* Get the alarm time from user */
  do
  {
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE);
    sprintf((char *)temp, "%.2d:%.2d:%.2d", time.Hours, time.Minutes, time.Seconds);
    UTIL_LCD_DisplayStringAt(statpos, 5 * font->Height, temp, LEFT_MODE);
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_PINK);

    switch(index)
    {
    case HOURS :
      position = statpos;
      sprintf((char *)temp, "%.2d", time.Hours);
      break;
    case MINUTES:
      position = statpos + (3 * font->Width);
      sprintf((char *)temp, "%.2d", time.Minutes);
      break;
    case SECONDS :
      position = statpos + (6 * font->Width);
      sprintf((char *)temp, "%.2d", time.Seconds);
      break;
    }
    UTIL_LCD_DisplayStringAt(position, 5 * font->Height, temp, LEFT_MODE);

    user_event = JOY_NONE;
    user_action = 0;
    while(user_event == JOY_NONE);
    switch(user_event)
    {
    case JOY_UP :
      if(index == HOURS)
      {
        if( time.Hours == 23 ) time.Hours = 0;
        else
          time.Hours++;
      }

      if(index == MINUTES)
      {
        if(time.Minutes == 59 ) time.Minutes= 0;
        else
          time.Minutes++;
      }
      if(index == SECONDS)
      {
        if(time.Seconds == 59 ) time.Seconds =0;
        else
          time.Seconds++;
      }
      break;
    case JOY_DOWN :
      if(index == HOURS)
      {
        if (time.Hours == 0 ) time.Hours = 23;
        else time.Hours--;
      }
      if(index == MINUTES)
      {
        if(time.Minutes == 0) time.Minutes=59;
        else
          time.Minutes--;
      }
      if(index == SECONDS)
      {
        if(time.Seconds == 0) time.Seconds = 59;
        else
          time.Seconds--;
      }
      break;
    case JOY_RIGHT :
      if(index != SECONDS ) index++;
      break;
    case JOY_LEFT :
      if(index != HOURS ) index--;
      break;
    case JOY_SEL :
      exit = 1;
      break;
    }
  } while(exit == 0);


  HAL_RTC_GetDate(&RtcHandle, &currentdate, RTC_FORMAT_BIN);
  HAL_Delay(100);
  HAL_RTC_GetTime(&RtcHandle, &currenttime,  RTC_FORMAT_BIN);
  time.SubSeconds = currenttime.SubSeconds;
  if((time.Seconds + currenttime.Seconds) > 60 )  time.Minutes++;
  Alarm.AlarmTime.Seconds = ((time.Seconds + currenttime.Seconds) % 60);

  if((time.Minutes + currenttime.Minutes) > 60 )  time.Hours++;
  Alarm.AlarmTime.Minutes = ((time.Minutes + currenttime.Minutes) % 60);

  Alarm.AlarmTime.Hours = ((time.Hours + currenttime.Hours) % 24);

  /* Set the alarm */
  Alarm.Alarm = RTC_ALARM_B;
  Alarm.AlarmDateWeekDay = RTC_WEEKDAY_MONDAY;
  Alarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
  Alarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
  Alarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
  Alarm.AlarmTime.TimeFormat = RTC_HOURFORMAT_24;
  if(HAL_RTC_SetAlarm_IT(&RtcHandle, &Alarm, RTC_FORMAT_BIN) != HAL_OK)
  {
    while(1);
  }
}

/**
  * @brief  Display message when exitting from Stop/Standby mode
  * @param  Mode   Mode which MCU exit from. Could be STANDBY or STOP
  * @retval None
  */
void LowPowerExitDisplay(uint32_t Mode)
{
  char msg[22] = "\n\nexit from\n";

