STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/lowpower/app_lowpower.c
  if(Mode == STANDBY)
  {
    strcat(msg, "STANDBY\n");
  }
  else if(Mode == SLEEP)
  {
    strcat(msg, "SLEEP\n");
  }
  else
  {
    strcat(msg, "STOP\n");
  }

  kWindow_Popup("Low Power", UTIL_LCD_COLOR_WHITE, UTIL_LCD_COLOR_ST_BLUE,\
                msg, UTIL_LCD_COLOR_ST_BLUE, UTIL_LCD_COLOR_WHITE );

  HAL_Delay(500);
}

/**
  * @brief  Deactivate RTC alarm
  * @param  hrtc RTChandle
  * @retval None
  */
void HAL_RTCEx_AlarmBEventCallback(RTC_HandleTypeDef *hrtc)
{
  HAL_RTC_DeactivateAlarm(&RtcHandle, RTC_ALARM_B);
}


/**
  * @brief  Disable System peripheral clocks, and optimse GPIO consumption
  * @param  WakeupSource source for wakeup. Could be WAKEUP_RTC or WAKEUP_GPIO
  * @retval None
  */
void SystemPeripheralClockDisable(uint32_t WakeupSource)
{
  GPIO_InitTypeDef GPIO_InitStructure;

   /* Enable GPIOs clock */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();

  /* Set all GPIO in analog state to reduce power consumption */
  /* But keep configuration of few GPIO to keep Demo working */
  GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStructure.Pull = GPIO_NOPULL;

//#define DEBUG_SWD
#if defined(DEBUG_SWD)
  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~( GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15));  // SWD
#else
  GPIO_InitStructure.Pin = GPIO_PIN_All;
#endif
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(GPIO_PIN_14 | GPIO_PIN_15));  // LCD
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

  if (WakeupSource == WAKEUP_GPIO)
  {
    GPIO_InitStructure.Pin = (GPIO_PIN_All & ~(GPIO_PIN_9 | GPIO_PIN_13)); // LCD + USER button
  }
  else
  { /* RTC wakeup */
    GPIO_InitStructure.Pin = (GPIO_PIN_All & ~GPIO_PIN_9); // LCD
  }
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

  GPIO_InitStructure.Pin = GPIO_PIN_All;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

  /* Disable remaining clocks */
  __HAL_RCC_FLASH_CLK_DISABLE();
  __HAL_RCC_SYSCFG_CLK_DISABLE();
  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();

  if (WakeupSource != WAKEUP_GPIO)
  {
    __HAL_RCC_GPIOC_CLK_DISABLE(); // GPIOC required for USER button
  }
  __HAL_RCC_GPIOD_CLK_DISABLE();
  __HAL_RCC_GPIOE_CLK_DISABLE();
  __HAL_RCC_GPIOF_CLK_DISABLE();
  __HAL_RCC_GPIOG_CLK_DISABLE();

  __HAL_RCC_I2C3_CLK_DISABLE();
  __HAL_RCC_SPI2_CLK_DISABLE();
  __HAL_RCC_DMA1_CLK_DISABLE();
  __HAL_RCC_DMA2_CLK_DISABLE();
  __HAL_RCC_FMC_CLK_DISABLE();
  __HAL_RCC_SAI1_CLK_DISABLE();
  __HAL_RCC_QSPI_CLK_DISABLE();
  if (WakeupSource != WAKEUP_RTC)
  {
    __HAL_RCC_RTC_DISABLE();
    __HAL_RCC_RTCAPB_CLK_DISABLE();
  }

  /* keep perihral clock disabled during sleep mode */
  RCC->AHB1SMENR  = 0x0;
  RCC->AHB2SMENR  = 0x0;
  RCC->AHB3SMENR  = 0x0;
  RCC->APB1SMENR1 = 0x0;
  RCC->APB1SMENR2 = 0x0;
  RCC->APB2SMENR  = 0x0;
}

/**
  * @brief  Restore System peripheral clocks and GPIO configuration
  * @param  wakeupsource source for wakeup. Could be WAKEUP_RTC or WAKEUP_GPIO
  * @retval None
  */
void SystemPeripheralClockEnable(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable minimum System peripheral clocks */
  /* others will be enabled via BSP layers   */
  __HAL_RCC_FLASH_CLK_ENABLE();
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();

  __HAL_RCC_I2C3_CLK_ENABLE();
  __HAL_RCC_SPI2_CLK_ENABLE();
  __HAL_RCC_RTC_ENABLE();
  __HAL_RCC_RTCAPB_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();

  /* PA0 used for MFX interrupt */
  GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Pin = GPIO_PIN_0 ;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Pin = GPIO_PIN_8 ;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);

  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Pin = GPIO_PIN_9 ;
  GPIO_InitStructure.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);

  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull = GPIO_PULLUP;
  GPIO_InitStructure.Pin = GPIO_PIN_11 ;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);
}

/**
  * @brief  Disable System peripheral clocks
  * @param  WakeupSource source for wakeup. Could be WAKEUP_RTC or WAKEUP_GPIO
  * @retval None
  */
void GPIOoptimStandby(uint32_t WakeupSource)
{
  GPIO_InitTypeDef GPIO_InitStructure;

   /* Enable GPIOs clock */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();

  /* Set all GPIO in analog state to reduce power consumption */
  GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStructure.Pull = GPIO_NOPULL;

  GPIO_InitStructure.Pin = GPIO_PIN_All;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);
  HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

  if (WakeupSource == WAKEUP_GPIO)
  {
    /* Keep pull up on PC13 during standby for user button wakeup  */
    HAL_PWREx_EnablePullUpPullDownConfig();
    HAL_PWREx_EnableGPIOPullUp(PWR_GPIO_C, PWR_GPIO_BIT_13);
  }
  /* Disable remaining clocks */
  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOC_CLK_DISABLE();
  __HAL_RCC_GPIOD_CLK_DISABLE();
  __HAL_RCC_GPIOE_CLK_DISABLE();
  __HAL_RCC_GPIOF_CLK_DISABLE();
  __HAL_RCC_GPIOG_CLK_DISABLE();
}

#undef __APP_LOWPOWER_C
#endif
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
